[
  {
    "id": 1,
    "company": "BEX Realty",
    "position": "Staff Software Engineer",
    "startDate": "June 2021",
    "endDate": "February 2024",
    "description": "<div>At BEX Realty, I spearheaded two major projects: the <strong>BEX Realty mobile apps</strong> and the <strong>Agent CRM</strong>. As the <strong>product manager, mobile architect, team lead, and lead developer</strong>, I wore multiple hats—driving the product vision, managing development, and ensuring seamless execution.</div> <div>I <strong>hired and led a team</strong> consisting of one designer and one developer, collaborating closely with the <strong>stakeholders</strong> to define product scope, roadmap, and release strategy. On the technical side, I <strong>architected the frontend</strong> with <strong>Flutter</strong>, utilizing <strong>BLoC</strong> and <strong>Clean Architecture</strong> for maintainability and scalability.</div> <div>For the <strong>CRM backend</strong>, I built over <strong>90% of the services</strong> using <strong>FeathersJS, Sequelize, MySQL, and Postgres</strong>, ensuring a robust and scalable infrastructure. Through this project, I combined <strong>engineering leadership, product ownership, and hands-on development</strong>, delivering high-impact tools that empowered real estate agents.</div>",
    "location": "Boca Raton, FL (Remote)",
    "tags": [
      "Flutter",
      "Dart",
      "BLoC",
      "Firebase",
      "Node.js",
      "FeathersJS",
      "Postgres",
      "NestJS",
      "GraphQL",
      "Hasura",
      "Nuxt",
      "Vue",
      "TypeScript",
      "JavaScript",
      "GCP",
      "Docker"
    ],
    "products": ["BEX Realty Mobile Apps", "Agent CRM", "Lead Market App"]
  },
  {
    "id": 2,
    "company": "BEX Realty",
    "position": "Senior Software Engineer",
    "startDate": "June 2018",
    "endDate": "July 2021",
    "description": "<div>I developed a <strong>mobile app for agents</strong> to manage leads using <strong>Flutter, Dart, and RxDart</strong>, ensuring a seamless user experience.</div><div>Additionally, I architected and built a <strong>Backend For Frontend (BFF)</strong> system for mobile apps using <strong>Kotlin, Ktor, and MySQL</strong>, optimizing performance and scalability.</div><div>I also designed and developed a <strong>messenger web app</strong> for Client Concierge Representatives using <strong>Nuxt, Vue, WebSocket, and Twilio</strong>, enhancing communication workflows.</div> <div>Furthermore, I developed and maintained <strong>backend APIs</strong> and the main website using <strong>FeathersJS, Postgres, and Vue.js</strong>, ensuring a robust and scalable infrastructure.</div>",
    "location": "Boca Raton, FL",
    "tags": [
      "Flutter",
      "Dart",
      "BLoC",
      "Kotlin",
      "Ktor",
      "Node.js",
      "FeathersJS",
      "MySQL",
      "Nuxt",
      "Vue",
      "JavaScript",
      "Vuetify",
      "GCP",
      "Docker"
    ],
    "products": ["Agent App", "BEX Realty Messenger", "BEX Realty Website"]
  },
  {
    "id": 3,
    "company": "Chewy",
    "position": "Lead Software Engineer - Android",
    "startDate": "October 2016",
    "endDate": "June 2018",
    "description": "<div>Established and led the <strong>Android team</strong>, taking ownership of the <strong>Chewy v1 Android app</strong> and driving the development of new features to enhance user experience and performance.</div><div>Spearheaded the <strong>re-architecture</strong> of the app to <strong>v2</strong>, leveraging <strong>Clean Architecture, MVVMP, RxJava, and functional programming</strong> to improve maintainability, scalability, and overall code quality.</div><div>Optimized backend communication by integrating <strong>gRPC</strong>, ensuring efficient data transfer, and enhanced dependency management and UI interactions with <strong>Dagger 2, Butter Knife, and Data Binding</strong>.</div><div>Collaborated closely with the <strong>product and design teams</strong> to streamline development workflows, enabling rapid iteration and allowing the Android app to quickly achieve feature parity with the website.</div>",
    "location": "Dania Beach, FL",
    "website": "https://www.chewy.com",
    "tags": [
      "Android",
      "Kotlin",
      "Java",
      "RxJava",
      "Retrofit",
      "Dagger",
      "Espresso",
      "Mockito"
    ],
    "products": ["Chewy Android App"]
  },
  {
    "id": 4,
    "company": "Charter Communications",
    "position": "Android Developer",
    "startDate": "May 2016",
    "endDate": "October 2016",
    "description": "<div>After the acquisition of <strong>Bright House Networks</strong>, I was transferred to the <strong>Charter Communications</strong> team to continue my work on the Spectrum TV Android app.</div> <div>I developed and integrated new <strong>DVR features</strong> into the app, enhancing user experience and functionality.</div> <div>Additionally, I collaborated with engineering teams to integrate <strong>BHTV</strong> with the new organization’s infrastructure, ensuring a smooth transition and system compatibility.</div>",
    "location": "Denver, CO (Remote)",
    "website": "https://www.spectrum.com",
    "tags": ["Android", "Java", "DRM"],
    "products": ["Spectrum TV Android App"]
  },
  {
    "id": 5,
    "company": "Bright House Networks",
    "position": "Android Developer",
    "startDate": "June 2014",
    "endDate": "May 2016",
    "description": "<div>I developed the <strong>Bright House TV (BHTV)</strong> Android app, transforming mobile devices into additional TV screens for subscribers, enhancing accessibility and engagement.</div> <div>I implemented a <strong>custom metrics system</strong> to gather app analytics and insights, improving performance monitoring and user experience.</div> <div>Additionally, I worked extensively with the <strong>Adobe Primetime SDK</strong> to enable <strong>Live TV and On-Demand streaming</strong>, focusing on <strong>HLS, DRM, and Dynamic Ad Insertion (DAI)</strong> to ensure seamless and secure content delivery.</div>",
    "location": "Tampa, FL",
    "website": "https://www.brighthouse.com",
    "tags": ["Android", "Java", "DRM"],
    "products": ["Bright House TV Android App"]
  }
]
